Repository: hoppinger/vcaching
Catalog: languages/vcaching-*.po
Languages: ro_ro

source: Purge cache
ro_ro: Sterge cache

source: URL to purge. Example : /wp-content/uploads/.*
ro_ro: Sterge URL. Exemplu : /wp-content/uploads/.*

source: Trying to purge URL :
ro_ro: Incercare de stergere URL :

source: Console
ro_ro: Consolă

source: Purge URL
ro_ro: Sterge URL

source: Options
ro_ro: Opţiuni

source: Homepage cache TTL
ro_ro: Cache TTL homepage

source: Dynamic host
ro_ro: Host dinamic

source: Hosts
ro_ro: Domenii

source: Override default TTL
ro_ro: Suprascrie TTL

source: Purge key
ro_ro: Cheia pentru purge

source: Enable debug
ro_ro: Activeaza debug

source: Enable Varnish caching
ro_ro: Activeaza caching Varnish

source: Time to live in seconds in Varnish cache for homepage
ro_ro: Secunde de caching in cache Varnish pentru homepage

source: Time to live in seconds in Varnish cache
ro_ro: Secunde de caching in cache Varnish

source: Comma separated ip/ip:port. Example : 192.168.0.2,192.168.0.3:8080
ro_ro: ip/ip:port separate de virgula. Exemple : 192.168.0.2,192.168.0.3:8080

source: Uses the $_SERVER['HTTP_HOST'] as hash for Varnish. This means the purge cache action will work on the domain you're on.<br />Use this option if you use only one domain.
ro_ro: Foloseste $_SERVER['HTTP_HOST'] ca hash pentru Varnish. Asta inseamna ca actiunea de purge va functiona doar pe domeniul care esti.<br />Foloseste aceasta optiune daca folosesti un singur domeniu.

source: Comma separated hostnames. Varnish uses the hostname to create the cache hash. For each IP, you must set a hostname.<br />Use this option if you use multiple domains.
ro_ro: Domenii separate de virgula. Varnish foloseste domeniul pentru a creea hash-ul pentru cache. Pentru fiecare IP, trebuie sa setezi un domeniu.<br />Foloseste aceasta optiune daca folosesti mai multe domenii.

source: Override default TTL on each post/page.
ro_ro: Suprascrie TTL pentru fiecare post/pagina.

source: Key used to purge Varnish cache. It is sent to Varnish as X-VC-Purge-Key header. Use a SHA-256 hash.<br />If you can't use ACL's, use this option.
ro_ro: Cheie folosita la stergerea cacheului. Este trimisa catre Varnish ca headerul X-VC-Purge-Key. Foloseste un hash gen SHA-256.<br />Daca nu poti folosi ACL, foloseste aceasta optiune.

source: Send all debugging headers to the client. Also shows complete response from Varnish on purge all.
ro_ro: Trimite toate headerele pentru debug catre client. De asemenea va arata raspunsul complet dat de Varnish la actiunea de sterge tot cacheul.

source: WordPress Varnish Cache integration.
ro_ro: Integrare WordPress cu Varnish Cache.

source: Not required. If filled in overrides default TTL of %s seconds. 0 means no caching.
ro_ro: Nu este obligatoriu. Daca este completat, va suprascrie TTL-ul de baza de %s secunde. 0 inseamna cache dezactivat.

source: Varnish message:
ro_ro: Mesaj de la Varnish:

source: Please set the IPs for Varnish!
ro_ro: Te rog sa setezi IP-urile pentru Varnish.

source: Varnish Caching requires you to use custom permalinks. Please go to the <a href="options-permalink.php">Permalinks Options Page</a> to configure them.
ro_ro: Varnish Caching are nevoie sa folosesti custom permalinks. Te rugam mergi la <a href="options-permalink.php">Permalinks Options Page</a> pentru a le configura.

source: Purge ALL Varnish Cache
ro_ro: Sterge TOT cacheul Varnish

source: Please setup Varnish IPs to be able to use <a href="%1$s">Varnish Caching</a>.
ro_ro: Te rugam sa setezi IP-urile pentru a putea folosi <a href="%1$s">Varnish Caching</a>.

source: <a href="%1$s">Varnish Caching</a> automatically purges your posts when published or updated. Sometimes you need a manual flush.
ro_ro: <a href="%1$s">Varnish Caching</a> sterge automat cache-ul cand publici sau modifici un post. Uneori e nevoie si de o stergere manuala.

source: Press the button below to force it to purge your entire cache.
ro_ro: Apasa butonul de mai jos pentru a forta stergerea totala a cache-ului.

source: You do not have permission to purge the cache for the whole site. Please contact your adminstrator.
ro_ro: Nu ai permisiunea sa stergi tot cache-ul. Te rugam contacteaza un administrator.

source: Varnish Caching
ro_ro: Caching Varnish

source: Enable
ro_ro: Activare
